create_clock -name clk -period 10 [get_ports clk]
set_input_delay -clock clk 2 [get_ports ui_in]
set_input_delay -clock clk 2 [get_ports uio_in]
set_output_delay -clock clk 2 [get_ports uo_out]
set_output_delay -clock clk 2 [get_ports uio_out]
